
[
    {
        "id": "aiche-sls-10th-anniversary-logo-competition-2025",
        "title": "AIChE SLS 10th Anniversary Logo Competition",
        "description": "Design the commemorative logo for the 10th Anniversary of AIChE Singapore Local Section. Show your creativity and celebrate a decade of chemical engineering excellence.",
        "details": "To celebrate the 10th Anniversary of the AIChE Singapore Local Section, we organized a logo design competition open to all students and young professionals. Participants were challenged to create a commemorative logo that captures the essence of chemical engineering innovation and community spirit in Singapore. The winning design was featured in all anniversary materials and events throughout 2025. This competition showcased the artistic and creative talents within our engineering community.",
        "imageUrl": "https://images.unsplash.com/photo-1541701494587-cb58502866ab?ixlib=rb-4.0.3&q=85&fm=jpg&crop=entropy&cs=srgb&w=400&h=300",
        "date": "April 15, 2025",
        "registrationUrl": "",
        "tags": [
            {"type": "string", "value": "Design"},
            {"type": "string", "value": "Anniversary"},
            {"type": "string", "value": "Singapore Local Section"},
            {"type": "string", "value": "Creative Competition"}
        ]
    },
    {
        "id": "competition-briefing-2025",
        "title": "AIChE Student Competition Briefing",
        "description": "Get a head start on major AIChE competitions like Chem-E-Car, Chem-E-Cube, and the Student Poster Competition. Learn the rules and form your teams!",
        "details": "This session is the official kickoff for the competition season. We will provide a detailed briefing on several key AIChE student competitions, including Chem-E-Car and Chem-E-Cube. We'll cover the objectives, rules, timelines, and tips for success. This is the perfect time to ask questions, find teammates, and start brainstorming your winning ideas.",
        "imageUrl": "https://picsum.photos/seed/competition1/400/300",
        "date": "November 1, 2025",
        "registrationUrl": ""
    },
    {
        "id": "aiche-week-hackathon-2026",
        "title": "AIChE Week – Hackathon",
        "description": "A week-long, high-intensity hackathon where teams will solve a real-world chemical engineering problem provided by an industry partner.",
        "details": "The highlight of our competitive calendar! In partnership with a major company like ExxonMobil or Sembcorp, we will host a week-long hackathon. Teams will be presented with a real-world industry challenge and will have one week to develop an innovative solution. The event will culminate in a presentation day where teams pitch their ideas to a panel of judges. The winners will be announced at the NTU x NUS exchange day.",
        "imageUrl": "https://picsum.photos/seed/competition2/400/300",
        "date": "March 21, 2026",
        "registrationUrl": ""
    }
]
